//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//Например:
//456 -> 6
//782 -> 2
//918 -> 8

//Ввод переменной и проверяем на ноль
int inputNum = int.Parse(Console.ReadLine() ?? "0");
//"Если значение более ста, то продолжаем, иначе выводим сообщение об ошибке"
if (number >= 100)





//Вывод ошибки
    Console.WriteLine("число не трёхзначное!");
}
